let clk = pack_array('A potentially malicious URL click', 'Suspicious URL clicked');
TABLE
| project 
    Title, Timestamp, AlertId, DetectionSource
| where 
    Title has_any (clk)
| where 
    Timestamp >= ago(1hr)
    
/// V2
//////////////
let clk = pack_array('A potentially malicious URL click', 'Suspicious URL clicked');
AlertInfo
| where Title has_any(clk)
| where Timestamp >= ago(5h)
| join kind=inner (AlertEvidence | project DeviceId, AlertId, DeviceName, Timestamp) on Timestamp
| join kind=inner (DeviceEvents | project DeviceId, ReportId) on DeviceId
| where isnotempty(DeviceId)
