let clk = pack_array('A potentially malicious URL click', 'Suspicious URL clicked');
TABLE
| project 
    Title, Timestamp, AlertId, DetectionSource
| where 
    Title has_any (clk)
| where 
    Timestamp >= ago(1hr)
    
/// V2
//////////////
let clk = pack_array('A potentially malicious URL click', 'Suspicious URL clicked');
AlertInfo
| where Title has_any(clk)
| where Timestamp >= ago(24h)
| join kind=inner (AlertEvidence | project DeviceId, AlertId, DeviceName) on AlertId
| join kind=inner (DeviceEvents | project DeviceId, ReportId) on DeviceId
| where isnotempty(DeviceId)
| summarize arg_max(Timestamp, *) by AlertId
